# ####################################################################

#  Created by Genus(TM) Synthesis Solution 19.13-s073_1 on Mon Oct 13 03:12:15 IST 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design FIFO

create_clock -name "write_clk" -period 3.0 -waveform {0.0 2.0} [get_ports write_clk]
set_clock_transition 0.6 [get_clocks write_clk]
create_clock -name "read_clk" -period 12.0 -waveform {0.0 6.0} [get_ports read_clk]
set_clock_transition 0.6 [get_clocks read_clk]
set_clock_groups -name "clock_groups_write_clk_to_read_clk" -asynchronous -group [get_clocks write_clk] -group [get_clocks read_clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks write_clk] -add_delay 0.5 [get_ports {write_data[7]}]
set_input_delay -clock [get_clocks write_clk] -add_delay 0.5 [get_ports {write_data[6]}]
set_input_delay -clock [get_clocks write_clk] -add_delay 0.5 [get_ports {write_data[5]}]
set_input_delay -clock [get_clocks write_clk] -add_delay 0.5 [get_ports {write_data[4]}]
set_input_delay -clock [get_clocks write_clk] -add_delay 0.5 [get_ports {write_data[3]}]
set_input_delay -clock [get_clocks write_clk] -add_delay 0.5 [get_ports {write_data[2]}]
set_input_delay -clock [get_clocks write_clk] -add_delay 0.5 [get_ports {write_data[1]}]
set_input_delay -clock [get_clocks write_clk] -add_delay 0.5 [get_ports {write_data[0]}]
set_input_delay -clock [get_clocks write_clk] -add_delay 0.5 [get_ports write_enable]
set_input_delay -clock [get_clocks write_clk] -add_delay 0.5 [get_ports write_reset_n]
set_input_delay -clock [get_clocks read_clk] -add_delay 0.5 [get_ports read_enable]
set_input_delay -clock [get_clocks read_clk] -add_delay 0.5 [get_ports read_reset_n]
set_output_delay -clock [get_clocks read_clk] -add_delay 0.5 [get_ports {read_data[7]}]
set_output_delay -clock [get_clocks read_clk] -add_delay 0.5 [get_ports {read_data[6]}]
set_output_delay -clock [get_clocks read_clk] -add_delay 0.5 [get_ports {read_data[5]}]
set_output_delay -clock [get_clocks read_clk] -add_delay 0.5 [get_ports {read_data[4]}]
set_output_delay -clock [get_clocks read_clk] -add_delay 0.5 [get_ports {read_data[3]}]
set_output_delay -clock [get_clocks read_clk] -add_delay 0.5 [get_ports {read_data[2]}]
set_output_delay -clock [get_clocks read_clk] -add_delay 0.5 [get_ports {read_data[1]}]
set_output_delay -clock [get_clocks read_clk] -add_delay 0.5 [get_ports {read_data[0]}]
set_output_delay -clock [get_clocks write_clk] -add_delay 0.5 [get_ports fifo_full]
set_output_delay -clock [get_clocks read_clk] -add_delay 0.5 [get_ports fifo_empty]
set_wire_load_mode "enclosed"
set_clock_latency -source 0.02 [get_clocks write_clk]
set_clock_uncertainty -setup 0.1 [get_clocks write_clk]
set_clock_uncertainty -hold 0.05 [get_clocks write_clk]
set_clock_latency -source 0.02 [get_clocks read_clk]
set_clock_uncertainty -setup 0.1 [get_clocks read_clk]
set_clock_uncertainty -hold 0.05 [get_clocks read_clk]
